// Question: คำสั่ง alert ในแต่ละบรรทัดจะแสดงค่าเป็นอะไรบ้าง
// ==================
alert(null || 2 || undefined);
// Result: 2
// เพราะ 2 เป็น true ตัวแรก

alert(alert(1) || 2 || alert(3));
// Result: 1, 2
// หลังจากทำ alert1 แล้วใด้ผลลัพธ์เป็น undifined มีค่าเป็น false แล้ว
// จึงเช็คค่าตัวถัดไป ซึ่ง 2 เป็นค่า true ตัวแรกจึงไม่แสดงตัวถัดไปอีก

alert(1 && null && 2);
// Result: null 
// เพราะ null เป็น false ตัวแรก

alert(alert(1) && alert(2));
// Result: 1, undefined
// เนื่องจาก && จะทำการ return ค่าที่เป็น false ตัวแรกมาให้
// ก็จะทำคำสั่ง alert 1 ก่อน โดยมีการ return ค่ากลับมาเป็น undefined
// ก็จะเอาค่า undefined มาแสดงเป็นผลลัพธ์

alert(null || (2 && 3) || 4);
// Result: 3
// เนื่องจาก || จะทำการ return ค่าที่เป็น True ตัวแรกมาให้
// เมื่อทำคำสั่ง 2 && 3 จะได้ค่า 3 เพราะ && คืนค่า true ตัวสุดท้าย
// แล้วเมื่อเอาค่า 3 มาเช็ค || ก็จะให้ค่าเป็น true ซึ่งเป็น true ตัวแรก
// ก็จะเอาค่า 3 มาแสดงเป็นผลลัพธ์


// Note:
// ===================
// Operation "||" จะ return ค่าที่เป็น True ตัวแรก
// Operation "&&" จะ return ค่าที่เป็น False ตัวแรก
// Operation "&&, ||" จะเช็คค่าไล่เรียงจากซ้ายไปขวา